//
//  Native Build System properties for the iOS platform
//  English localization
//

"Name" = "Standard Build Settings";
"Description" = "General";


// Deployment Settings

"[Deployment]-category" = "Deployment";

"[IPHONEOS_DEPLOYMENT_TARGET]-name" = "iOS Deployment Target";
"[IPHONEOS_DEPLOYMENT_TARGET]-description" = "Code will load on this and later versions of iOS.  Framework APIs that are unavailable in earlier versions will be weak-linked; your code should check for null function pointers or specific system versions before calling newer APIs. [IPHONEOS_DEPLOYMENT_TARGET]

iOS 3.0 - Code will not load on systems earlier than 3.0. [3.0]
iOS 3.1 - Code will not load on systems earlier than 3.1. [3.1]
iOS 3.1.2 - Code will not load on systems earlier than 3.1.2. [3.1.2]
iOS 3.1.3 - Code will not load on systems earlier than 3.1.3. [3.1.3]
iOS 3.2 - Code will not load on systems earlier than 3.2. [3.2]
iOS 3.2.1 - Code will not load on systems earlier than 3.2.1. [3.2.1]
iOS 3.2.2 - Code will not load on systems earlier than 3.2.2. [3.2.2]
iOS 4.0 - Code will not load on systems earlier than 4.0. [4.0]
iOS 4.0.1 - Code will not load on systems earlier than 4.0.1. [4.0.1]
iOS 4.0.2 - Code will not load on systems earlier than 4.0.2. [4.0.2]
iOS 4.1 - Code will not load on systems earlier than 4.1. [4.1]
iOS 4.2 - Code will not load on systems earlier than 4.2. [4.2]
iOS 4.3 - Code will not load on systems earlier than 4.3. [4.3]

";
// Supported IPHONEOS_DEPLOYMENT_TARGETs 
"[IPHONEOS_DEPLOYMENT_TARGET]-value-[3.0]" = "iOS 3.0";
"[IPHONEOS_DEPLOYMENT_TARGET]-description-[3.0]" = "Code will not load on systems earlier than 3.0. [3.0]";
"[IPHONEOS_DEPLOYMENT_TARGET]-value-[3.1]" = "iOS 3.1";
"[IPHONEOS_DEPLOYMENT_TARGET]-description-[3.1]" = "Code will not load on systems earlier than 3.1. [3.1]";
"[IPHONEOS_DEPLOYMENT_TARGET]-value-[3.1.2]" = "iOS 3.1.2";
"[IPHONEOS_DEPLOYMENT_TARGET]-description-[3.1.2]" = "Code will not load on systems earlier than 3.1.2. [3.1.2]";
"[IPHONEOS_DEPLOYMENT_TARGET]-value-[3.1.3]" = "iOS 3.1.3";
"[IPHONEOS_DEPLOYMENT_TARGET]-description-[3.1.3]" = "Code will not load on systems earlier than 3.1.3. [3.1.3]";
"[IPHONEOS_DEPLOYMENT_TARGET]-value-[3.2]" = "iOS 3.2";
"[IPHONEOS_DEPLOYMENT_TARGET]-description-[3.2]" = "Code will not load on systems earlier than 3.2. [3.2]";
"[IPHONEOS_DEPLOYMENT_TARGET]-value-[3.2.1]" = "iOS 3.2.1";
"[IPHONEOS_DEPLOYMENT_TARGET]-description-[3.2.1]" = "Code will not load on systems earlier than 3.2.1. [3.2.1]";
"[IPHONEOS_DEPLOYMENT_TARGET]-value-[3.2.2]" = "iOS 3.2.2";
"[IPHONEOS_DEPLOYMENT_TARGET]-description-[3.2.2]" = "Code will not load on systems earlier than 3.2.2. [3.2.2]";
"[IPHONEOS_DEPLOYMENT_TARGET]-value-[4.0]" = "iOS 4.0";
"[IPHONEOS_DEPLOYMENT_TARGET]-description-[4.0]" = "Code will not load on systems earlier than 4.0. [4.0]";
"[IPHONEOS_DEPLOYMENT_TARGET]-value-[4.0.1]" = "iOS 4.0.1";
"[IPHONEOS_DEPLOYMENT_TARGET]-description-[4.0.1]" = "Code will not load on systems earlier than 4.0.1. [4.0.1]";
"[IPHONEOS_DEPLOYMENT_TARGET]-value-[4.0.2]" = "iOS 4.0.2";
"[IPHONEOS_DEPLOYMENT_TARGET]-description-[4.0.2]" = "Code will not load on systems earlier than 4.0.2. [4.0.2]";
"[IPHONEOS_DEPLOYMENT_TARGET]-value-[4.1]" = "iOS 4.1";
"[IPHONEOS_DEPLOYMENT_TARGET]-description-[4.1]" = "Code will not load on systems earlier than 4.1. [4.1]";
"[IPHONEOS_DEPLOYMENT_TARGET]-value-[4.2]" = "iOS 4.2";
"[IPHONEOS_DEPLOYMENT_TARGET]-description-[4.2]" = "Code will not load on systems earlier than 4.2. [4.2]";
"[IPHONEOS_DEPLOYMENT_TARGET]-value-[4.3]" = "iOS 4.3";
"[IPHONEOS_DEPLOYMENT_TARGET]-description-[4.3]" = "Code will not load on systems earlier than 4.3. [4.3]";



// Build Setting for TARGETED_DEVICE_FAMILY, used to setup the Info.plist's DeviceFamily 
"[TARGETED_DEVICE_FAMILY]-name" = "Targeted Device Family";
"[TARGETED_DEVICE_FAMILY]-description" = "The build system uses the selected device to set the correct value for the UIDeviceFamily key it adds to the target's Info.plist file. [TARGETED_DEVICE_FAMILY]

iPhone - Application is built for iPhone and iPod touch.
iPad - Application is built for iPad.
iPhone/iPad - Application is built Universal for iPhone, iPod touch, and iPad.

";
"[TARGETED_DEVICE_FAMILY]-value-[1]" = "iPhone";
"[TARGETED_DEVICE_FAMILY]-description-[1]" = "The Application is built for iPhone and iPod touch.";
"[TARGETED_DEVICE_FAMILY]-value-[2]" = "iPad";
"[TARGETED_DEVICE_FAMILY]-description-[2]" = "The Application is built for iPad.";
"[TARGETED_DEVICE_FAMILY]-value-[1,2]" = "iPhone/iPad";
"[TARGETED_DEVICE_FAMILY]-description-[1,2]" = "The Application is built Universal for iPhone, iPod touch, and iPad.";


// Linking Settings

"[Linking]-category" = "Linking";

"[LD_NO_PIE]-name" = "Don't Create Position Independent Executables";
"[LD_NO_PIE]-description" = "Activating this setting will cause Xcode to not create position independent executables.  [LD_NO_PIE, -no_pie]";


// Code Signing Settings

"[Code Signing]-category" = "Code Signing";

// this is now a hidden internal build setting automatically calculated.
//"[PROVISIONING_PROFILE]-name" = "Code Signing Provisioning Profile";
//"[PROVISIONING_PROFILE]-description" = "The profile to embed in the build product during code signing.  This must correspond to the code signing identity.  [PROVISIONING_PROFILE]";

// Build Setting for CopyPNGFile tool
"[Packaging]-category" = "Packaging";
"[COMPRESS_PNG_FILES]-name" = "Compress PNG Files";
"[COMPRESS_PNG_FILES]-description" = "<p>Image files with <code>.png</code>&thinsp; extension are compressed as they are copied. [<code>COMPRESS_PNG_FILES</code>]</p>

<p><b>IMPORTANT:</b>&thinsp; The functionality of this Xcode build setting has been modified!</p>

<p>Previously, this setting had a Boolean <code>YES</code>&thinsp; / <code>NO</code>&thinsp; value. This has been changed to the following:</p>

<table>
<tr><td valign='top'><code>None</code></td><td valign='top'>Identical to the unmodified <code>COMPRESS_PNG_FILES</code>&thinsp; <code>NO</code>&thinsp; setting.</td></tr>
<tr><td valign='top'><code>Low</code></td><td valign='top'>Identical to the unmodified <code>COMPRESS_PNG_FILES</code>&thinsp; <code>YES</code>&thinsp; setting.  This uses the Apple proprietery version of <code>pngcrush</code>&thinsp; to optimize PNG files for the iPhone.</td></tr>
<tr><td valign='top'><code>Medium</code></td><td valign='top'>The compressed PNG files from the <code>Low</code>&thinsp; setting are further optimized by the <code>advpngidat</code>&thinsp; command.</td></tr>
<tr><td valign='top'><code>High</code></td><td valign='top'>The same as <code>Medium</code>, except a handful of carefully chosen <code>-m</code>&thinsp; compression methods that work much better in practice are used instead of the default heuristic used by <code>pngcrush</code>.</td></tr>
<tr><td valign='top'><code>Extreme</code></td><td valign='top'>The same as <code>Medium</code>, except <code>pngcrush</code>&thinsp; is passed the <code>-brute</code>&thinsp; option which tries all of the compression method permutations.<p><b>Warning:</b>&thinsp; This can take a <i><b>very</b></i>&thinsp; long time!</p></td></tr>
</table>";
